configuration/src/Catalogs/MessageTemplates/MessageTemplates.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>MessageTemplates</name>
  <basedOn>Document.OutgoingEmail</basedOn>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>TemplateOwner</name>
    <type>
      <types>DefinedType.MessageTemplateOwner</types>
    </type>
  </attributes>
  <attributes>
    <name>ExternalDataProcessor</name>
    <type>
      <types>CatalogRef.AdditionalReportsAndDataProcessors</types>
    </type>
  </attributes>
  <attributes>
    <name>AddAttachedFiles</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Purpose</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Sender</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SendInTransliteration</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SignatureAndSeal</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>InputOnBasisParameterTypeFullName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ForSMSMessages</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ForInputOnBasis</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ForEmails</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SMSTemplateText</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MessageTemplateText</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>HTMLEmailTemplateText</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>EmailSubject</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EmailTextType</name>
    <type>
      <types>EnumRef.EmailEditingMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>AuthorOnly</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TransliterateFileNames</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PackToArchive</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AttachmentFormat</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>TemplateByExternalDataProcessor</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>PrintFormsAndAttachments</name>
    <attributes>
      <name>Id</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Parameters</name>
    <attributes>
      <name>ParameterName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ParameterType</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ParameterPresentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Catalogs/MessageTemplates/Forms/FillArbitraryParameters/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#Region EventHandlersForm

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	SubjectOf = Parameters.SubjectOf;
	AddTemplateParametersFormItems(Parameters.Template);
	
EndProcedure

#EndRegion

#Region FormCommandHandlers

&AtClient
Procedure OK(Command)
	Result = New Map;
	
	For Each AttributeName In AttributesList Do
		Result.Insert(AttributeName.Value, ThisObject[AttributeName.Value])
	EndDo;
	
	Close(Result);
EndProcedure

#EndRegion

#Region Private

&AtServer
Procedure AddTemplateParametersFormItems(Template)
	
	AttributesToBeAdded = New Array;
	If Template.TemplateByExternalDataProcessor Then
		
		If Common.SubsystemExists("StandardSubsystems.AdditionalReportsAndDataProcessors") Then
			ModuleAdditionalReportsAndDataProcessors = Common.CommonModule("AdditionalReportsAndDataProcessors");
			ExternalObject = ModuleAdditionalReportsAndDataProcessors.ExternalDataProcessorObject(Template.ExternalDataProcessor);
			TemplateParameters = ExternalObject.TemplateParameters();
			
			TemplateParametersTable = New ValueTable;
			TemplateParametersTable.Columns.Add("Name"                , New TypeDescription("String", , New StringQualifiers(50, AllowedLength.Variable)));
			TemplateParametersTable.Columns.Add("Type"                , New TypeDescription("TypeDescription"));
			TemplateParametersTable.Columns.Add("Presentation"      , New TypeDescription("String", , New StringQualifiers(150, AllowedLength.Variable)));
			
			For Each TemplateParameter In TemplateParameters Do
				TypeDetails = TemplateParameter.TypeDetails.Types();
				If TypeDetails.Count() > 0 Then
					If TypeDetails[0] <> TypeOf(SubjectOf) Then
						NewParameter1 = TemplateParametersTable.Add();
						NewParameter1.Name = TemplateParameter.ParameterName;
						NewParameter1.Presentation = TemplateParameter.ParameterPresentation;
						NewParameter1.Type = TemplateParameter.TypeDetails;
						AttributesToBeAdded.Add(New FormAttribute(TemplateParameter.ParameterName, TemplateParameter.TypeDetails,, TemplateParameter.ParameterPresentation));
					EndIf;
					
				EndIf;
			EndDo;
		EndIf;
	Else
		Query = New Query;
		Query.Text = 
		"SELECT
		|	MessageTemplatesParameters.Ref,
		|	MessageTemplatesParameters.ParameterName AS Name,
		|	MessageTemplatesParameters.ParameterType AS Type,
		|	MessageTemplatesParameters.ParameterPresentation AS Presentation
		|FROM
		|	Catalog.MessageTemplates.Parameters AS MessageTemplatesParameters
		|WHERE
		|	MessageTemplatesParameters.Ref = &Ref";
		
		Query.SetParameter("Ref", Template);
		
		TemplateParametersTable = Query.Execute().Unload();
		
		For Each Attribute In TemplateParametersTable Do
			
			DescriptionOfTheParameterType = Common.StringTypeDetails(250);
			If TypeOf(Attribute.Type) = Type("ValueStorage") Then
				TheTypeOfTheParameterValue = Attribute.Type.Get();
				If TypeOf(TheTypeOfTheParameterValue) = Type("TypeDescription") Then
					DescriptionOfTheParameterType = TheTypeOfTheParameterValue;
				EndIf;
			EndIf;
			
			AttributesToBeAdded.Add(New FormAttribute(Attribute.Name, DescriptionOfTheParameterType,, Attribute.Presentation));
			
		EndDo;
	EndIf;
	
	ChangeAttributes(AttributesToBeAdded);
	
	For Each TemplateParameter In TemplateParametersTable Do
		Item = Items.Add(TemplateParameter.Name, Type("FormField"), Items.TemplateParameters);
		Item.Type                        = FormFieldType.InputField;
		Item.TitleLocation         = FormItemTitleLocation.Left;
		Item.Title                  = TemplateParameter.Presentation;
		Item.DataPath                = TemplateParameter.Name;
		Item.HorizontalStretch   = False;
		Item.Width = 50;
		AttributesList.Add(TemplateParameter.Name);
	EndDo;
	
	Height = 3 + TemplateParametersTable.Count() * 2;
	
EndProcedure

#EndRegion
